/*
 Navicat Premium Data Transfer

 Source Server         : MariaDB_uz
 Source Server Type    : MariaDB
 Source Server Version : 110402
 Source Host           : localhost:3306
 Source Schema         : spb

 Target Server Type    : MariaDB
 Target Server Version : 110402
 File Encoding         : 65001

 Date: 15/06/2024 18:16:15
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user`  (
  `user_id` int(11) NOT NULL,
  `user_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `passwd` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `user_type` int(11) NULL DEFAULT NULL,
  PRIMARY KEY (`user_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_bin ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES (12000, 'root', 'root', 1);
INSERT INTO `user` VALUES (12001, 'uz', 'uz', 1);

-- ----------------------------
-- Table structure for 有效能
-- ----------------------------
DROP TABLE IF EXISTS `有效能`;
CREATE TABLE `有效能`  (
  `序号` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `中国饲料号` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `饲料名称` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `干物质` double NULL DEFAULT NULL,
  `粗蛋白质` double NULL DEFAULT NULL,
  `猪消化能Mcal/kg` double NULL DEFAULT NULL,
  `猪消化能MJ/kg` double NULL DEFAULT NULL,
  `猪代谢能Mcal/kg 猪代谢能MJ/kg` double NULL DEFAULT NULL,
  `猪净能Mcal/kg` double NULL DEFAULT NULL,
  `猪净能MJ/kg` double NULL DEFAULT NULL,
  `鸡代谢能Mcal/kg` double NULL DEFAULT NULL,
  `鸡代谢能MJ/kg` double NULL DEFAULT NULL,
  `肉牛维持净能Mcal/kg` double NULL DEFAULT NULL,
  `肉牛维持净能MJ/kg` double NULL DEFAULT NULL,
  `肉牛增重净能Mcal/kg` double NULL DEFAULT NULL,
  `肉牛增重净能MJ/kg` double NULL DEFAULT NULL,
  `奶牛产奶净能Mcal/kg` double NULL DEFAULT NULL,
  `肉牛增重净能MJ/kg1` double NULL DEFAULT NULL,
  `羊消化能Mcal/kg` double NULL DEFAULT NULL,
  `肉牛增重净能MJ/kg2` double NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_bin ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of 有效能
-- ----------------------------
INSERT INTO `有效能` VALUES ('1', '4-07-0278', '玉米', 86, 9.4, 3.44, 14.39, 3.24, 13.57, 2.66, 11.14, 3.18, 13.31, 2.2, 9.19, 1.68, 7.02, 1.83, 7.66, 3.4);
INSERT INTO `有效能` VALUES ('2', '4-07-0288', '玉米', 86, 8.5, 3.45, 14.43, 3.25, 13.6, 2.67, 11.17, 3.25, 13.6, 2.24, 9.39, 1.72, 7.21, 1.84, 7.7, 3.41);
INSERT INTO `有效能` VALUES ('3', '4-07-0279', '玉米', 86, 8.7, 3.41, 14.27, 3.21, 13.43, 2.64, 11.04, 3.24, 13.56, 2.21, 9.25, 1.69, 7.09, 1.84, 7.7, 3.41);
INSERT INTO `有效能` VALUES ('4', '4-07-0280', '玉米', 86, 8, 3.42, 14.33, 3.34, 13.98, 2.66, 11.14, 3.22, 13.47, 2.19, 9.16, 1.67, 7, 1.83, 7.66, 3.38);
INSERT INTO `有效能` VALUES ('5', '4-07-0272', '高粱', 86, 9, 3.15, 13.18, 2.97, 12.43, 2.44, 10.2, 2.94, 12.3, 1.86, 7.8, 1.3, 5.44, 1.59, 6.65, 3.12);
INSERT INTO `有效能` VALUES ('6', '4-07-0270', '小麦', 88, 13.4, 3.39, 14.18, 3.16, 13.22, 2.54, 10.64, 3.04, 12.72, 2.09, 8.73, 1.55, 6.46, 1.75, 7.32, 3.4);
INSERT INTO `有效能` VALUES ('7', '4-07-0274', '大麦(裸)', 87, 13, 3.24, 13.56, 3.03, 12.68, 2.43, 10.17, 2.68, 11.21, 1.99, 8.31, 1.43, 5.99, 1.68, 7.03, 3.21);
INSERT INTO `有效能` VALUES ('8', '4-07-0277', '大麦(皮)', 87, 11, 3.02, 12.64, 2.83, 11.84, 2.27, 9.48, 2.7, 11.3, 1.9, 7.95, 1.35, 5.64, 1.62, 6.78, 3.16);
INSERT INTO `有效能` VALUES ('9', '4-07-0281', '黑麦', 88, 11, 3.31, 13.85, 3.1, 12.97, 2.5, 10.46, 2.69, 11.25, 1.98, 8.27, 1.42, 5.95, 1.68, 7.03, 3.39);
INSERT INTO `有效能` VALUES ('10', '4-07-0273', '稻谷', 86, 7.8, 2.69, 11.25, 2.54, 10.63, 1.91, 7.99, 2.63, 11, 1.8, 7.54, 1.28, 5.33, 1.53, 6.4, 3.02);
INSERT INTO `有效能` VALUES ('11', '4-07-0276', '糙米', 87, 8.8, 3.44, 14.39, 3.24, 13.57, 2.68, 11.21, 3.36, 14.06, 2.22, 9.28, 1.71, 7.16, 1.84, 7.7, 3.41);
INSERT INTO `有效能` VALUES ('12', '4-07-0275', '碎米', 88, 10.4, 3.6, 15.06, 3.38, 14.14, 2.64, 11.05, 3.4, 14.23, 2.4, 10.05, 1.92, 8.03, 1.97, 8.24, 3.43);
INSERT INTO `有效能` VALUES ('13', '4-07-0479', '粟(谷子)', 86.5, 9.7, 3.09, 12.93, 2.91, 12.18, 2.32, 9.71, 2.84, 11.88, 1.97, 8.25, 1.43, 6, 1.67, 6.99, 3);
INSERT INTO `有效能` VALUES ('14', '4-04-0067', '木薯干', 87, 2.5, 3.13, 13.1, 2.97, 12.43, 2.51, 10.5, 2.96, 12.38, 1.67, 6.99, 1.12, 4.7, 1.43, 5.98, 2.99);
INSERT INTO `有效能` VALUES ('15', '4-04-0068', '甘薯干', 87, 4, 2.82, 11.8, 2.68, 11.21, 2.26, 9.46, 2.34, 9.79, 1.85, 7.76, 1.33, 5.57, 1.57, 6.57, 3.27);
INSERT INTO `有效能` VALUES ('16', '4-08-0104', '次粉', 88, 15.4, 3.27, 13.68, 3.04, 12.72, 2.27, 9.5, 3.05, 12.76, 2.41, 10.1, 1.92, 8.02, 1.99, 8.32, 3.32);
INSERT INTO `有效能` VALUES ('17', '4-08-0105', '次粉', 87, 13.6, 3.21, 13.43, 2.99, 12.51, 2.23, 9.33, 2.99, 12.51, 2.37, 9.92, 1.88, 7.87, 1.95, 8.16, 3.25);
INSERT INTO `有效能` VALUES ('18', '4-08-0069', '小麦麸', 87, 15.7, 2.24, 9.37, 2.08, 8.7, 1.52, 6.36, 1.36, 5.69, 1.67, 7.01, 1.09, 4.55, 1.46, 6.11, 2.91);
INSERT INTO `有效能` VALUES ('19', '4-08-0070', '小麦麸', 87, 14.3, 2.23, 9.33, 2.07, 8.66, 1.52, 6.36, 1.35, 5.65, 1.66, 6.95, 1.07, 4.5, 1.45, 6.08, 2.89);
INSERT INTO `有效能` VALUES ('20', '4-08-0041', '米糠', 87, 12.8, 3.02, 12.64, 2.82, 11.8, 2.22, 9.29, 2.68, 11.21, 2.05, 8.58, 1.4, 5.85, 1.78, 7.45, 3.29);
INSERT INTO `有效能` VALUES ('21', '4-10-0025', '米糠饼', 88, 14.7, 2.99, 12.51, 2.78, 11.63, 2.12, 8.87, 2.43, 10.17, 1.72, 7.2, 1.11, 4.65, 1.5, 6.28, 2.85);
INSERT INTO `有效能` VALUES ('22', '4-10-0018', '米糠粕', 87, 15.1, 2.76, 11.55, 2.57, 10.75, 1.96, 8.2, 1.98, 8.28, 1.45, 6.06, 0.9, 3.75, 1.26, 5.27, 2.39);
INSERT INTO `有效能` VALUES ('23', '5-09-0127', '大豆', 87, 35.5, 3.97, 16.61, 3.53, 14.77, 2.72, 11.38, 3.24, 13.56, 2.16, 9.03, 1.42, 5.93, 1.9, 7.95, 3.91);
INSERT INTO `有效能` VALUES ('24', '5-09-0128', '全脂大豆', 88, 35.5, 4.24, 17.74, 3.77, 15.77, 2.76, 11.55, 3.48, 14.55, 2.2, 9.19, 1.44, 6.01, 1.94, 8.12, 3.99);
INSERT INTO `有效能` VALUES ('25', '5-10-0241', '大豆饼', 89, 41.8, 3.44, 14.39, 3.01, 12.59, 2.01, 8.41, 2.52, 10.54, 2.02, 8.44, 1.36, 5.67, 1.75, 7.32, 3.37);
INSERT INTO `有效能` VALUES ('26', '5-10-0103', '去皮大豆粕', 89, 47.9, 3.6, 15.06, 3.11, 13.01, 2.09, 8.74, 2.53, 10.58, 2.07, 8.68, 1.45, 6.06, 1.78, 7.45, 3.42);
INSERT INTO `有效能` VALUES ('27', '5-10-0102', '大豆粕', 89, 44.2, 3.37, 14.26, 2.97, 12.43, 2.02, 8.45, 2.39, 10, 2.08, 8.71, 1.48, 6.2, 1.78, 7.45, 3.41);
INSERT INTO `有效能` VALUES ('28', '5-10-0118', '棉籽饼', 88, 36.3, 2.37, 9.92, 2.1, 8.79, 1.33, 5.56, 2.16, 9.04, 1.79, 7.51, 1.13, 4.72, 1.58, 6.61, 3.16);
INSERT INTO `有效能` VALUES ('29', '5-10-0119', '棉籽粕', 90, 47, 2.25, 9.41, 1.95, 8.28, 1.37, 5.73, 1.86, 7.78, 1.78, 7.44, 1.13, 4.73, 1.56, 6.53, 3.12);
INSERT INTO `有效能` VALUES ('30', '5-10-0117', '棉籽粕', 90, 43.5, 2.31, 9.68, 2.01, 8.43, 1.41, 5.9, 2.03, 8.49, 1.76, 7.35, 1.12, 4.69, 1.54, 6.44, 2.98);
INSERT INTO `有效能` VALUES ('31', '5-10-0220', '棉籽蛋白', 92, 51.1, 2.45, 10.25, 2.13, 8.91, 1.49, 6.23, 2.16, 9.04, 1.87, 7.82, 1.2, 5.02, 1.82, 7.61, 3.16);
INSERT INTO `有效能` VALUES ('32', '5-10-0183', '菜籽饼', 88, 35.7, 2.88, 12.05, 2.56, 10.71, 1.78, 7.45, 1.95, 8.16, 1.59, 6.64, 0.93, 3.9, 1.42, 5.94, 3.14);
INSERT INTO `有效能` VALUES ('33', '5-10-0121', '菜籽粕', 88, 38.6, 2.53, 10.59, 2.23, 9.33, 1.47, 6.15, 1.77, 7.41, 1.57, 6.56, 0.95, 3.98, 1.39, 5.82, 2.88);
INSERT INTO `有效能` VALUES ('34', '5-10-0116', '花生仁饼', 88, 44.7, 3.08, 12.89, 2.68, 11.21, 1.88, 7.87, 2.78, 11.63, 2.37, 9.91, 1.73, 7.22, 2.02, 8.45, 3.44);
INSERT INTO `有效能` VALUES ('35', '5-10-0115', '花生仁粕', 88, 47.8, 2.97, 12.43, 2.56, 10.71, 1.67, 6.99, 2.6, 10.88, 2.1, 8.8, 1.48, 6.2, 1.8, 7.53, 3.24);
INSERT INTO `有效能` VALUES ('36', '5-10-0031', '向日葵仁饼', 88, 29, 1.89, 7.91, 1.7, 7.11, 1, 4.18, 1.59, 6.65, 1.43, 5.99, 0.82, 3.41, 1.28, 5.36, 2.1);
INSERT INTO `有效能` VALUES ('37', '5-10-0242', '向日葵仁粕', 88, 36.5, 2.78, 11.63, 2.46, 10.29, 1.33, 5.56, 2.32, 9.71, 1.75, 7.33, 1.14, 4.76, 1.53, 6.4, 2.54);
INSERT INTO `有效能` VALUES ('38', '5-10-0243', '向日葵仁粕', 88, 33.6, 2.49, 10.42, 2.22, 9.29, 1.19, 4.98, 2.03, 8.49, 1.58, 6.6, 0.93, 3.9, 1.41, 5.9, 2.04);
INSERT INTO `有效能` VALUES ('39', '5-10-0119', '亚麻仁饼', 88, 32.2, 2.9, 12.13, 2.6, 10.88, 1.74, 7.28, 2.34, 9.79, 1.9, 7.96, 1.25, 5.23, 1.66, 6.95, 3.2);
INSERT INTO `有效能` VALUES ('40', '5-10-0120', '亚麻仁粕', 88, 34.8, 2.37, 9.92, 2.11, 8.83, 1.4, 5.86, 1.9, 7.95, 1.78, 7.44, 1.17, 4.89, 1.54, 6.44, 2.99);
INSERT INTO `有效能` VALUES ('41', '5-10-0246', '芝麻饼', 92, 39.2, 3.2, 13.39, 2.82, 11.8, 1.89, 7.91, 2.14, 8.95, 1.92, 8.02, 1.23, 5.13, 1.69, 7.07, 3.51);
INSERT INTO `有效能` VALUES ('42', '5-11-0001', '玉米蛋白粉', 90.1, 63.5, 3.6, 15.06, 3, 12.55, 2.16, 9.04, 3.88, 16.23, 2.32, 9.71, 1.58, 6.61, 2.02, 8.45, 4.39);
INSERT INTO `有效能` VALUES ('43', '5-11-0002', '玉米蛋白粉', 88, 56.3, 3.73, 15.61, 3.19, 13.35, 2.24, 9.37, 3.41, 14.27, 2.14, 8.96, 1.4, 5.85, 1.89, 7.91, 3.56);
INSERT INTO `有效能` VALUES ('44', '5-11-0008', '玉米蛋白粉', 89.9, 44.3, 3.59, 15.02, 3.13, 13.1, 2.15, 9, 3.18, 13.31, 1.93, 8.08, 1.26, 5.26, 1.74, 7.28, 3.28);
INSERT INTO `有效能` VALUES ('45', '5-11-0003', '玉米蛋白饲料', 88, 19.3, 2.48, 10.38, 2.28, 9.54, 1.69, 7.07, 2.02, 8.45, 2, 8.36, 1.36, 5.69, 1.7, 7.11, 3.2);
INSERT INTO `有效能` VALUES ('46', '4-10-0026', '玉米胚芽饼', 90, 16.7, 3.51, 14.69, 3.25, 13.6, 2.21, 9.25, 2.24, 9.37, 2.06, 8.62, 1.4, 5.86, 1.75, 7.32, 3.29);
INSERT INTO `有效能` VALUES ('47', '4-10-0244', '玉米胚芽粕', 90, 20.8, 3.28, 13.72, 3.01, 12.59, 2.07, 8.66, 2.07, 8.66, 1.87, 7.83, 1.27, 5.33, 1.6, 6.69, 3.01);
INSERT INTO `有效能` VALUES ('48', '5-11-0007', '玉米DDGS', 89.2, 27.5, 3.43, 14.35, 3.1, 12.97, 2.25, 9.41, 2.2, 9.2, 1.86, 7.78, 1.57, 6.58, 2.14, 8.97, 3.5);
INSERT INTO `有效能` VALUES ('49', '5-11-0009', '蚕豆粉浆蛋白粉', 88, 66.3, 3.23, 13.51, 2.69, 11.25, 1.87, 7.82, 3.47, 14.52, 2.16, 9.03, 1.47, 6.16, 1.92, 8.03, 3.61);
INSERT INTO `有效能` VALUES ('50', '5-11-0004', '麦芽根', 89.7, 28.3, 2.31, 9.67, 2.09, 8.74, 1.25, 5.23, 1.41, 5.9, 1.6, 6.69, 1.02, 4.29, 1.43, 5.98, 2.73);
INSERT INTO `有效能` VALUES ('51', '5-13-0044', '鱼粉(CP67%)', 92.4, 67, 3.22, 13.47, 2.67, 11.16, 1.93, 8.08, 3.1, 12.97, 1.72, 7.2, 1.1, 4.6, 2.33, 9.75, 3.09);
INSERT INTO `有效能` VALUES ('52', '5-13-0046', '鱼粉(CP60.2%)', 90, 60.2, 3, 12.55, 2.52, 10.54, 1.8, 7.53, 2.82, 11.8, 1.86, 7.77, 1.19, 4.98, 1.63, 6.82, 3.07);
INSERT INTO `有效能` VALUES ('53', '5-13-0077', '鱼粉(CP53.5%)', 90, 53.5, 3.09, 12.93, 2.63, 11, 1.85, 7.74, 2.9, 12.13, 1.85, 7.72, 1.21, 5.05, 1.61, 6.74, 3.14);
INSERT INTO `有效能` VALUES ('54', '5-13-0036', '血粉', 88, 82.8, 2.73, 11.42, 2.16, 9.04, 1.42, 5.94, 2.46, 10.29, 1.45, 6.08, 0.75, 3.13, 1.34, 5.61, 2.4);
INSERT INTO `有效能` VALUES ('55', '5-13-0037', '羽毛粉', 88, 77.9, 2.77, 11.59, 2.22, 9.29, 1.43, 5.98, 2.73, 11.42, 1.46, 6.1, 0.76, 3.19, 1.34, 5.61, 2.54);
INSERT INTO `有效能` VALUES ('56', '5-13-0038', '皮革粉', 88, 74.7, 2.75, 11.51, 2.23, 9.33, 1.32, 5.52, 1.48, 6.19, 0.67, 2.81, 0.37, 1.55, 0.74, 3.1, 2.64);
INSERT INTO `有效能` VALUES ('57', '5-13-0047', '肉骨粉', 93, 50, 2.83, 11.84, 2.43, 10.17, 1.61, 6.74, 2.38, 9.96, 1.65, 6.91, 1.08, 4.53, 1.43, 5.98, 2.77);
INSERT INTO `有效能` VALUES ('58', '5-13-0048', '肉粉', 94, 54, 2.7, 11.3, 2.3, 9.62, 1.54, 6.44, 2.2, 9.2, 1.66, 6.95, 1.05, 4.39, 1.34, 5.61, 2.52);
INSERT INTO `有效能` VALUES ('59', '1-05-0074', '苜蓿草粉(CP19%)', 87, 19.1, 1.66, 6.95, 1.53, 6.4, 0.81, 3.39, 0.97, 4.06, 1.29, 5.4, 0.73, 3.04, 1.15, 4.81, 2.36);
INSERT INTO `有效能` VALUES ('60', '1-05-0075', '苜蓿草粉(CP17%)', 87, 17.2, 1.46, 6.11, 1.35, 5.65, 0.7, 2.93, 0.87, 3.64, 1.29, 5.38, 0.73, 3.05, 1.14, 4.77, 2.29);
INSERT INTO `有效能` VALUES ('61', '1-05-0076', '苜蓿草粉(CP14%)', 87, 14.3, 1.49, 6.23, 1.39, 5.82, 0.69, 2.89, 0.84, 3.51, 1.11, 4.66, 0.57, 2.4, 1, 4.18, 1.87);
INSERT INTO `有效能` VALUES ('62', '5-11-0005', '啤酒糟', 88, 24.3, 2.25, 9.41, 2.05, 8.58, 1.24, 5.19, 2.37, 9.92, 1.56, 6.55, 0.93, 3.9, 1.39, 5.82, 2.58);
INSERT INTO `有效能` VALUES ('63', '7-15-0001', '啤酒酵母', 91.7, 52.4, 3.54, 14.81, 3.02, 12.64, 1.95, 8.16, 2.52, 10.54, 1.9, 7.93, 1.22, 5.1, 1.67, 6.99, 3.21);
INSERT INTO `有效能` VALUES ('64', '4-13-0075', '乳清粉', 91.7, 11.5, 3.49, 14.6, 3.42, 14.31, 2.7, 11.29, 2.73, 11.42, 2.05, 8.56, 1.53, 6.39, 1.72, 7.2, 3.43);
INSERT INTO `有效能` VALUES ('65', '5-01-0162', '酪蛋白', 97.2, 88.9, 4.13, 17.28, 3.53, 14.77, 2.09, 8.74, 4.13, 17.28, 3.14, 13.14, 2.36, 9.88, 2.31, 9.67, 4.28);
INSERT INTO `有效能` VALUES ('66', '5-14-0503', '明胶', 90, 88.6, 2.8, 11.72, 2.19, 9.16, 1.43, 5.98, 2.36, 9.87, 1.8, 7.53, 1.36, 5.7, 1.56, 6.53, 3.36);
INSERT INTO `有效能` VALUES ('67', '4-06-0076', '牛奶乳糖', 96, 3.5, 3.37, 14.1, 3.21, 13.43, 2.79, 11.67, 2.69, 11.25, 2.32, 9.72, 1.85, 7.76, 1.91, 7.99, 3.48);
INSERT INTO `有效能` VALUES ('68', '4-06-0077', '乳糖', 96, 0.3, 3.53, 14.77, 3.39, 14.18, 2.93, 12.26, 2.7, 11.3, 2.31, 9.67, 1.84, 7.7, 2.06, 8.62, 3.92);
INSERT INTO `有效能` VALUES ('69', '4-06-0078', '葡萄糖', 90, 0.3, 3.36, 14.06, 3.22, 13.47, 2.79, 11.67, 3.08, 12.89, 2.66, 11.13, 2.13, 8.92, 1.76, 7.36, 3.28);
INSERT INTO `有效能` VALUES ('70', '4-06-0079', '蔗糖', 99, NULL, 3.8, 15.9, 3.65, 15.27, 3.15, 13.18, 3.9, 16.32, 3.37, 14.1, 2.69, 11.26, 2.06, 8.62, 4.02);
INSERT INTO `有效能` VALUES ('71', '4-02-0889', '玉米淀粉', 99, 0.3, 4, 16.74, 3.84, 16.07, 3.28, 13.72, 3.16, 13.22, 2.73, 11.43, 2.2, 9.12, 1.87, 7.82, 3.5);
INSERT INTO `有效能` VALUES ('72', '4-17-0001', '牛油', 99, NULL, 8, 33.47, 7.68, 32.13, 7.19, 30.08, 7.78, 32.55, 4.76, 19.9, 3.52, 14.73, 4.23, 17.7, 7.62);
INSERT INTO `有效能` VALUES ('73', '4-17-0002', '猪油', 99, NULL, 8.29, 34.69, 7.96, 33.3, 7.39, 30.92, 9.11, 38.11, 5.6, 23.43, 4.15, 17.37, 4.86, 20.34, 8.51);
INSERT INTO `有效能` VALUES ('74', '4-17-0003', '家禽脂肪', 99, NULL, 8.52, 35.65, 8.18, 34.23, 7.55, 31.59, 9.36, 39.16, 5.47, 22.89, 4.1, 17, 4.96, 20.76, 8.68);
INSERT INTO `有效能` VALUES ('75', '4-17-0004', '鱼油', 99, NULL, 8.44, 35.31, 8.1, 33.89, 7.5, 31.38, 8.45, 35.35, 9.55, 39.92, 5.26, 21.2, 4.64, 19.4, 8.36);
INSERT INTO `有效能` VALUES ('76', '4-17-0005', '菜籽油', 99, NULL, 8.76, 36.65, 8.41, 35.19, 7.72, 32.32, 9.21, 38.53, 10.14, 42.3, 5.68, 23.77, 5.01, 20.97, 8.92);
INSERT INTO `有效能` VALUES ('77', '4-17-0006', '玉米油', 99, NULL, 8.75, 36.61, 8.4, 35.15, 7.71, 32.29, 9.66, 40.42, 10.44, 43.64, 5.75, 24.1, 5.26, 22.01, 9.42);
INSERT INTO `有效能` VALUES ('78', '4-17-0007', '椰子油', 99, NULL, 8.4, 35.11, 8.06, 33.69, 7.47, 31.27, 8.81, 36.83, 9.78, 40.92, 5.58, 23.35, 4.79, 20.05, 8.63);
INSERT INTO `有效能` VALUES ('79', '4-17-0008', '棉籽油', 99, NULL, 8.6, 35.98, 8.26, 34.43, 7.61, 31.86, 9.05, 37.87, 10.2, 42.68, 5.72, 23.94, 4.92, 20.06, 8.91);
INSERT INTO `有效能` VALUES ('80', '4-17-0009', '棕榈油', 99, NULL, 8.01, 33.51, 7.69, 32.17, 7.2, 30.3, 5.8, 24.27, 6.56, 27.45, 3.94, 16.5, 3.16, 13.23, 5.76);
INSERT INTO `有效能` VALUES ('81', '4-17-0010', '花生油', 99, NULL, 8.73, 36.53, 8.38, 35.06, 7.7, 32.24, 9.36, 39.16, 10.5, 43.89, 5.57, 23.31, 5.09, 21.3, 9.17);
INSERT INTO `有效能` VALUES ('82', '4-17-0011', '芝麻油', 99, NULL, 8.75, 36.61, 8.4, 35.15, 7.72, 32.3, 8.48, 35.48, 9.6, 40.14, 5.2, 21.76, 4.61, 19.29, 8.35);
INSERT INTO `有效能` VALUES ('83', '4-17-0012', '大豆油', 99, NULL, 8.75, 36.61, 8.4, 35.15, 7.72, 32.23, 8.37, 35.02, 9.38, 39.21, 5.44, 22.76, 4.55, 19.04, 8.29);
INSERT INTO `有效能` VALUES ('84', '4-17-0013', '葵花油', 99, NULL, 8.76, 36.65, 8.41, 35.19, 7.73, 32.32, 9.66, 40.42, 10.44, 43.64, 5.43, 22.72, 5.26, 22.01, 9.47);

-- ----------------------------
-- Table structure for 饲料中氨基酸含量
-- ----------------------------
DROP TABLE IF EXISTS `饲料中氨基酸含量`;
CREATE TABLE `饲料中氨基酸含量`  (
  `序号` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `中国饲料号` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `饲料名称` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `干物质` double NULL DEFAULT NULL,
  `粗蛋白质` double NULL DEFAULT NULL,
  `精氨酸` double NULL DEFAULT NULL,
  `组氨酸` double NULL DEFAULT NULL,
  `异亮氨酸` double NULL DEFAULT NULL,
  `亮氨酸` double NULL DEFAULT NULL,
  `赖氨酸` double NULL DEFAULT NULL,
  `蛋氨酸` double NULL DEFAULT NULL,
  `胱氨酸` double NULL DEFAULT NULL,
  `苯丙氨酸` double NULL DEFAULT NULL,
  `酪氨酸` double NULL DEFAULT NULL,
  `苏氨酸` double NULL DEFAULT NULL,
  `色氨酸` double NULL DEFAULT NULL,
  `缬氨酸` double NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_bin ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of 饲料中氨基酸含量
-- ----------------------------
INSERT INTO `饲料中氨基酸含量` VALUES ('1', '4-07-0278', '玉米corn grain', 86, 9.4, 0.38, 0.23, 0.26, 1.03, 0.26, 0.19, 0.22, 0.43, 0.34, 0.31, 0.08, 0.4);
INSERT INTO `饲料中氨基酸含量` VALUES ('2', '4-07-0288', '玉米corn grain', 86, 8.5, 0.5, 0.29, 0.27, 0.74, 0.36, 0.15, 0.18, 0.37, 0.28, 0.3, 0.08, 0.46);
INSERT INTO `饲料中氨基酸含量` VALUES ('3', '4-07-0279', '玉米corn grain', 86, 8.7, 0.39, 0.21, 0.25, 0.93, 0.24, 0.18, 0.2, 0.41, 0.33, 0.3, 0.07, 0.38);
INSERT INTO `饲料中氨基酸含量` VALUES ('4', '4-07-0280', '玉米corn grain', 86, 8, 0.37, 0.23, 0.27, 0.96, 0.24, 0.17, 0.17, 0.37, 0.31, 0.29, 0.06, 0.35);
INSERT INTO `饲料中氨基酸含量` VALUES ('5', '4-07-0272', '高粱sorghum grain', 88, 8.7, 0.33, 0.2, 0.34, 1.08, 0.21, 0.15, 0.15, 0.41, 0, 0.28, 0.09, 0.42);
INSERT INTO `饲料中氨基酸含量` VALUES ('6', '4-07-0270', '小麦wheat grain', 88, 13.4, 0.62, 0.3, 0.46, 0.89, 0.35, 0.21, 0.3, 0.61, 0.37, 0.38, 0.15, 0.56);
INSERT INTO `饲料中氨基酸含量` VALUES ('7', '4-07-0274', '大麦（裸）naked barley grain', 87, 13, 0.64, 0.16, 0.43, 0.87, 0.44, 0.14, 0.25, 0.68, 0.4, 0.43, 0.16, 0.63);
INSERT INTO `饲料中氨基酸含量` VALUES ('8', '4-07-0277', '大麦（皮）barley grain', 87, 11, 0.65, 0.24, 0.52, 0.91, 0.42, 0.18, 0.18, 0.59, 0.35, 0.41, 0.12, 0.64);
INSERT INTO `饲料中氨基酸含量` VALUES ('9', '4-07-0281', '黑麦rye', 88, 9.5, 0.48, 0.22, 0.3, 0.58, 0.35, 0.15, 0.21, 0.42, 0.26, 0.31, 0.1, 0.43);
INSERT INTO `饲料中氨基酸含量` VALUES ('10', '4-07-0273', '稻谷paddy', 86, 7.8, 0.57, 0.15, 0.32, 0.58, 0.29, 0.19, 0.16, 0.4, 0.37, 0.25, 0.1, 0.47);
INSERT INTO `饲料中氨基酸含量` VALUES ('11', '4-07-0276', '糙米rough rice', 87, 8.8, 0.65, 0.17, 0.3, 0.61, 0.32, 0.2, 0.14, 0.35, 0.31, 0.28, 0.12, 0.49);
INSERT INTO `饲料中氨基酸含量` VALUES ('12', '4-07-0275', '碎米broken rice', 88, 10.4, 0.78, 0.27, 0.39, 0.74, 0.42, 0.22, 0.17, 0.49, 0.39, 0.38, 0.12, 0.57);
INSERT INTO `饲料中氨基酸含量` VALUES ('13', '4-07-0479', '粟（谷子）millet grain', 86.5, 9.7, 0.3, 0.2, 0.36, 1.15, 0.15, 0.25, 0.2, 0.49, 0.26, 0.35, 0.17, 0.42);
INSERT INTO `饲料中氨基酸含量` VALUES ('14', '4-04-0067', '木薯干cassava tuber flake', 87, 2.5, 0.4, 0.05, 0.11, 0.15, 0.13, 0.05, 0.04, 0.1, 0.04, 0.1, 0.03, 0.13);
INSERT INTO `饲料中氨基酸含量` VALUES ('15', '4-04-0068', '甘薯干sweet potato tuber flake', 87, 4, 0.16, 0.08, 0.17, 0.26, 0.16, 0.06, 0.08, 0.19, 0.13, 0.18, 0.05, 0.27);
INSERT INTO `饲料中氨基酸含量` VALUES ('16', '4-08-0104', '次粉wheat middling and reddog', 88, 15.4, 0.86, 0.41, 0.55, 1.06, 0.59, 0.23, 0.37, 0.66, 0.46, 0.5, 0.21, 0.72);
INSERT INTO `饲料中氨基酸含量` VALUES ('17', '4-08-0105', '次粉wheat middling and reddog', 87, 13.6, 0.85, 0.33, 0.48, 0.98, 0.52, 0.16, 0.33, 0.63, 0.45, 0.5, 0.18, 0.68);
INSERT INTO `饲料中氨基酸含量` VALUES ('18', '4-08-0069', '小麦麸wheat bran', 87, 15.7, 1, 0.41, 0.51, 0.96, 0.63, 0.23, 0.32, 0.62, 0.43, 0.5, 0.25, 0.71);
INSERT INTO `饲料中氨基酸含量` VALUES ('19', '4-08-0070', '小麦麸wheat bran', 87, 14.3, 0.88, 0.37, 0.46, 0.88, 0.56, 0.22, 0.31, 0.57, 0.34, 0.45, 0.18, 0.65);
INSERT INTO `饲料中氨基酸含量` VALUES ('20', '4-08-0041', '米糠rice bran', 87, 14.5, 1.2, 0.44, 0.71, 1.13, 0.84, 0.28, 0.21, 0.71, 0.56, 0.54, 0.16, 0.91);
INSERT INTO `饲料中氨基酸含量` VALUES ('21', '4-10-0025', '米糠饼rice bran meal(exp.)', 88, 15, 1.19, 0.43, 0.72, 1.06, 0.66, 0.26, 0.3, 0.76, 0.51, 0.53, 0.15, 0.99);
INSERT INTO `饲料中氨基酸含量` VALUES ('22', '4-10-0018', '米糠粕rice bran meal(sol.)', 87, 15.1, 1.28, 0.46, 0.78, 1.3, 0.72, 0.28, 0.32, 0.82, 0.55, 0.57, 0.17, 1.07);
INSERT INTO `饲料中氨基酸含量` VALUES ('23', '5-09-0127', '大豆soybeans', 87, 35.5, 2.57, 0.59, 1.28, 2.72, 2.2, 0.56, 0.7, 1.42, 0.64, 1.41, 0.45, 1.5);
INSERT INTO `饲料中氨基酸含量` VALUES ('24', '5-09-0128', '全脂大豆full-fat soybeans', 88, 35.5, 2.62, 0.95, 1.63, 2.64, 2.2, 0.53, 0.57, 1.77, 1.25, 1.43, 0.45, 1.69);
INSERT INTO `饲料中氨基酸含量` VALUES ('25', '5-10-0241', '大豆饼soybean meal(exp.)', 89, 41.8, 2.53, 1.1, 1.57, 2.75, 2.43, 0.6, 0.62, 1.79, 1.53, 1.44, 0.64, 1.7);
INSERT INTO `饲料中氨基酸含量` VALUES ('26', '5-10-0103', '去皮大豆粕soybean meal(sol.)', 89, 47.9, 3.43, 1.22, 2.1, 3.57, 2.99, 0.68, 0.73, 2.33, 1.57, 1.85, 0.65, 2.26);
INSERT INTO `饲料中氨基酸含量` VALUES ('27', '5-10-0102', '大豆粕soybean meal(sol.)', 89, 44.2, 3.38, 1.17, 1.99, 3.35, 2.68, 0.59, 0.65, 2.21, 1.47, 1.71, 0.57, 2.09);
INSERT INTO `饲料中氨基酸含量` VALUES ('28', '5-10-0118', '棉籽饼cottonseed meal(exp.)', 88, 36.3, 3.94, 0.9, 1.16, 2.07, 1.4, 0.41, 0.7, 1.88, 0.95, 1.14, 0.39, 1.51);
INSERT INTO `饲料中氨基酸含量` VALUES ('29', '5-10-0119', '棉籽粕cottonseed meal(sol.)', 88, 47, 5.44, 1.28, 1.41, 2.6, 2.13, 0.65, 0.75, 2.47, 1.46, 1.43, 0.57, 1.98);
INSERT INTO `饲料中氨基酸含量` VALUES ('30', '5-10-0117', '棉籽粕cottonseed meal(sol.)', 90, 43.5, 4.65, 1.19, 1.29, 2.47, 1.97, 0.58, 0.68, 2.28, 1.05, 1.25, 0.51, 1.91);
INSERT INTO `饲料中氨基酸含量` VALUES ('31', '5-10-0220', '棉籽蛋白cottonseed protein', 92, 51.1, 6.08, 1.58, 1.72, 3.13, 2.26, 0.86, 1.04, 2.94, 1.42, 1.6, NULL, 2.48);
INSERT INTO `饲料中氨基酸含量` VALUES ('32', '5-10-0183', '菜籽饼rapeseed meal(exp.)', 88, 35.7, 1.82, 0.83, 1.24, 2.26, 1.33, 0.6, 0.82, 1.35, 0.92, 1.4, 0.42, 1.62);
INSERT INTO `饲料中氨基酸含量` VALUES ('33', '5-10-0121', '菜籽粕rapeseed meal(sol.)', 88, 38.6, 1.83, 0.86, 1.29, 2.34, 1.3, 0.63, 0.87, 1.45, 0.97, 1.49, 0.43, 1.74);
INSERT INTO `饲料中氨基酸含量` VALUES ('34', '5-10-0116', '花生仁饼peanut meal(exp.)', 88, 44.7, 4.6, 0.83, 1.18, 2.36, 1.32, 0.39, 0.38, 1.81, 1.31, 1.05, 0.42, 1.28);
INSERT INTO `饲料中氨基酸含量` VALUES ('35', '5-10-0115', '花生仁粕peanut meal(sol.)', 88, 47.8, 4.88, 0.88, 1.25, 2.5, 1.4, 0.41, 0.4, 1.92, 1.39, 1.11, 0.45, 1.36);
INSERT INTO `饲料中氨基酸含量` VALUES ('36', '5-10-0031', '向日葵仁饼sunflower meal(exp.)', 88, 29, 2.44, 0.62, 1.19, 1.76, 0.96, 0.59, 0.43, 1.21, 0.77, 0.98, 0.28, 1.35);
INSERT INTO `饲料中氨基酸含量` VALUES ('37', '5-10-0242', '向日葵仁粕sunflower meal(sol.)', 88, 36.5, 3.17, 0.81, 1.51, 2.25, 1.22, 0.72, 0.62, 1.56, 0.99, 1.25, 0.47, 1.72);
INSERT INTO `饲料中氨基酸含量` VALUES ('38', '5-10-0243', '向日葵仁粕sunflower meal(sol.)', 88, 33.6, 2.89, 0.74, 1.39, 2.07, 1.13, 0.69, 0.5, 1.43, 0.91, 1.14, 0.37, 1.58);
INSERT INTO `饲料中氨基酸含量` VALUES ('39', '5-10-0119', '亚麻仁饼linseed meal(exp.)', 88, 32.2, 2.35, 0.51, 1.15, 1.62, 0.73, 0.46, 0.48, 1.32, 0.5, 1, 0.48, 1.44);
INSERT INTO `饲料中氨基酸含量` VALUES ('40', '5-10-0120', '亚麻仁粕linseed meal(sol.)', 88, 34.8, 3.59, 0.64, 1.33, 1.85, 1.16, 0.55, 0.55, 1.51, 0.93, 1.1, 0.7, 1.51);
INSERT INTO `饲料中氨基酸含量` VALUES ('41', '5-10-0246', '芝麻饼sesame meal(exp.)', 92, 39.2, 2.38, 0.81, 1.42, 2.52, 0.82, 0.82, 0.75, 1.68, 1.02, 1.29, 0.49, 1.84);
INSERT INTO `饲料中氨基酸含量` VALUES ('42', '5-11-0001', '玉米蛋白粉corn gluten meal', 90.1, 63.5, 2.01, 1.23, 2.92, 10.5, 1.1, 1.6, 0.99, 3.94, 3.19, 2.11, 0.36, 2.94);
INSERT INTO `饲料中氨基酸含量` VALUES ('43', '5-11-0002', '玉米蛋白粉corn gluten meal', 88, 56.3, 1.73, 1.17, 2.21, 8.91, 0.92, 1.38, 1, 3.38, 3.04, 1.88, 0.28, 2.58);
INSERT INTO `饲料中氨基酸含量` VALUES ('44', '5-11-0008', '玉米蛋白粉corn gluten meal', 89.9, 44.3, 1.31, 0.78, 1.63, 7.08, 0.71, 1.04, 0.65, 2.61, 2.03, 1.38, 0, 1.84);
INSERT INTO `饲料中氨基酸含量` VALUES ('45', '5-11-0003', '玉米蛋白饲料corn gluten feed', 88, 18.3, 0.74, 0.54, 0.54, 1.57, 0.55, 0.3, 0.39, 0.62, 0.5, 0.66, 0.08, 0.87);
INSERT INTO `饲料中氨基酸含量` VALUES ('46', '4-10-0026', '玉米胚芽饼corn germ meal(exp.)', 90, 16.7, 1.16, 0.45, 0.53, 1.25, 0.7, 0.31, 0.47, 0.64, 0.54, 0.64, 0.16, 0.91);
INSERT INTO `饲料中氨基酸含量` VALUES ('47', '4-10-0244', '玉米胚芽粕corn germ meal(sol.)', 90, 20.8, 1.51, 0.62, 0.77, 1.54, 0.75, 0.21, 0.28, 0.93, 0.66, 0.68, 0.18, 1.66);
INSERT INTO `饲料中氨基酸含量` VALUES ('48', '5-11-0007', '玉米DDGS', 89.2, 27.5, 1.12, 0.75, 0.97, 3.13, 0.71, 0.57, 0.54, 1.28, 1.09, 0.99, 0.2, 1.32);
INSERT INTO `饲料中氨基酸含量` VALUES ('49', '5-11-0009', '蚕豆粉浆蛋白粉broad bean gluten meal', 88, 66.3, 5.96, 1.66, 2.9, 5.88, 4.44, 0.6, 0.57, 3.34, 2.21, 2.31, 0, 3.2);
INSERT INTO `饲料中氨基酸含量` VALUES ('50', '5-11-0004', '麦芽根barley malt sprouts', 89.7, 28.3, 1.22, 0.54, 1.08, 1.58, 1.3, 0.37, 0.26, 0.85, 0.67, 0.96, 0.42, 1.44);
INSERT INTO `饲料中氨基酸含量` VALUES ('51', '5-13-0044', '鱼粉(CP67%)fish meal', 92.4, 67, 3.93, 2.01, 2.61, 4.94, 4.97, 1.86, 0.6, 2.61, 1.97, 2.74, 0.77, 3.11);
INSERT INTO `饲料中氨基酸含量` VALUES ('52', '5-13-0046', '鱼粉(CP60.2%)fish meal', 90, 60.2, 3.57, 1.71, 2.68, 4.8, 4.72, 1.64, 0.52, 2.35, 1.96, 2.57, 0.7, 3.17);
INSERT INTO `饲料中氨基酸含量` VALUES ('53', '5-13-0077', '鱼粉(CP53.5%)fish meal', 90, 53.5, 3.24, 1.29, 2.3, 4.3, 3.87, 1.39, 0.49, 2.22, 1.7, 2.51, 0.6, 2.77);
INSERT INTO `饲料中氨基酸含量` VALUES ('54', '5-13-0036', '血粉blood meal', 88, 82.8, 2.99, 4.4, 0.75, 8.38, 6.67, 0.74, 0.98, 5.23, 2.55, 2.86, 1.11, 6.08);
INSERT INTO `饲料中氨基酸含量` VALUES ('55', '5-13-0037', '羽毛粉feather meal', 88, 77.9, 5.3, 0.58, 4.21, 6.78, 1.65, 0.59, 2.93, 3.57, 1.79, 3.51, 0.4, 6.05);
INSERT INTO `饲料中氨基酸含量` VALUES ('56', '5-13-0038', '皮革粉leather meal', 88, 74.7, 4.45, 0.4, 1.06, 2.53, 2.18, 0.8, 0.16, 1.56, 0.63, 0.71, 0.5, 1.91);
INSERT INTO `饲料中氨基酸含量` VALUES ('57', '5-13-0047', '肉骨粉meat and bone meal', 93, 50, 3.35, 0.96, 1.7, 3.2, 2.6, 0.67, 0.33, 1.7, 1.26, 1.63, 0.26, 2.25);
INSERT INTO `饲料中氨基酸含量` VALUES ('58', '5-13-0048', '肉粉meat meal', 94, 54, 3.6, 1.14, 1.6, 3.84, 3.07, 0.8, 0.6, 2.17, 1.4, 1.97, 0.35, 2.66);
INSERT INTO `饲料中氨基酸含量` VALUES ('59', '1-05-0074', '苜蓿草粉(CP19%) alfalfa meal', 87, 19.1, 0.78, 0.39, 0.68, 1.2, 0.82, 0.21, 0.22, 0.82, 0.58, 0.74, 0.43, 0.91);
INSERT INTO `饲料中氨基酸含量` VALUES ('60', '1-05-0075', '苜蓿草粉(CP17%) alfalfa meal', 87, 17.2, 0.74, 0.32, 0.66, 1.1, 0.81, 0.2, 0.16, 0.81, 0.54, 0.69, 0.37, 0.85);
INSERT INTO `饲料中氨基酸含量` VALUES ('61', '1-05-0076', '苜蓿草粉(CP14%~15%)alfalfa meal', 87, 14.3, 0.61, 0.19, 0.58, 1, 0.6, 0.18, 0.15, 0.59, 0.38, 0.45, 0.24, 0.58);
INSERT INTO `饲料中氨基酸含量` VALUES ('62', '5-11-0005', '啤酒糟brewers dried grain', 88, 24.3, 0.98, 0.51, 1.18, 1.08, 0.72, 0.52, 0.35, 2.35, 1.17, 0.81, 0.28, 1.66);
INSERT INTO `饲料中氨基酸含量` VALUES ('63', '7-15-0001', '啤酒酵母brewers dried yeast', 91.7, 52.4, 2.67, 1.11, 2.85, 4.76, 3.38, 0.83, 0.5, 4.07, 0.12, 2.33, 0.21, 3.4);
INSERT INTO `饲料中氨基酸含量` VALUES ('64', '4-13-0075', '乳清粉whey, dehydrated', 97.2, 11.5, 0.26, 0.21, 0.64, 1.11, 0.88, 0.17, 0.26, 0.35, 0.27, 0.71, 0.2, 0.61);
INSERT INTO `饲料中氨基酸含量` VALUES ('65', '5-01-0162', '酪蛋白casein', 91.7, 88.9, 3.13, 2.57, 4.49, 8.24, 6.87, 2.52, 0.45, 4.49, 4.87, 3.77, 1.33, 5.81);
INSERT INTO `饲料中氨基酸含量` VALUES ('66', '5-14-0503', '明胶gelatin', 90, 88.6, 6.6, 0.66, 1.42, 2.91, 3.62, 0.76, 0.12, 1.74, 0.43, 1.82, 0.05, 2.26);
INSERT INTO `饲料中氨基酸含量` VALUES ('67', '4-06-0076', '牛奶乳糖milk lactose', 96, 3.5, 0.25, 0.09, 0.09, 0.16, 0.14, 0.03, 0.04, 0.09, 0.02, 0.09, 0.09, 0.09);

-- ----------------------------
-- Table structure for 饲料描述及常规成分
-- ----------------------------
DROP TABLE IF EXISTS `饲料描述及常规成分`;
CREATE TABLE `饲料描述及常规成分`  (
  `序号` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `中国饲料号CFN` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `饲料名称` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `饲料描述` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `干物质` double NULL DEFAULT NULL,
  `粗蛋白质` double NULL DEFAULT NULL,
  `粗脂肪` double NULL DEFAULT NULL,
  `粗纤维` double NULL DEFAULT NULL,
  `无氮浸出物` double NULL DEFAULT NULL,
  `粗灰分` double NULL DEFAULT NULL,
  `中洗纤维` double NULL DEFAULT NULL,
  `酸洗纤维` double NULL DEFAULT NULL,
  `淀粉` double NULL DEFAULT NULL,
  `钙` double NULL DEFAULT NULL,
  `总磷` double NULL DEFAULT NULL,
  `有效磷` double NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_bin ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of 饲料描述及常规成分
-- ----------------------------
INSERT INTO `饲料描述及常规成分` VALUES ('1', '4-07-0278', '玉米corn grain', '成熟,高蛋白,优质', 88, 9, 3.5, 2.8, 71.5, 1.2, 9.1, 3.3, 61.7, 0.01, 0.31, 0.09);
INSERT INTO `饲料描述及常规成分` VALUES ('2', '4-07-0288', '玉米corn grain', '成熟,高赖氨酸,优质', 86, 8.5, 5.3, 2.6, 68.3, 1.3, 9.4, 3.5, 59, 0.16, 0.25, 0.05);
INSERT INTO `饲料描述及常规成分` VALUES ('3', '4-07-0279', '玉米corn grain', '成熟,GB1353-2018,1级', 86, 8.7, 3.6, 1.6, 70.7, 1.4, 9.3, 2.7, 65.4, 0.02, 0.27, 0.05);
INSERT INTO `饲料描述及常规成分` VALUES ('4', '4-07-0280', '玉米corn grain', '成熟,GB1353-2018,2级', 86, 8, 3.6, 2.3, 71.8, 1.2, 9.9, 3.1, 63.5, 0.02, 0.27, 0.05);
INSERT INTO `饲料描述及常规成分` VALUES ('5', '4-07-0272', '高粱sorghum grain', '成熟,GB 8231-87', 88, 8.7, 3.4, 1.4, 70.7, 1.8, 17.4, 8, 68, 0.13, 0.36, 0.09);
INSERT INTO `饲料描述及常规成分` VALUES ('6', '4-07-0270', '小麦wheat grain', '混合小麦,成熟GB1351-2008 2级', 88, 13.4, 1.7, 1.9, 69.1, 1.9, 13.3, 3.9, 54.6, 0.17, 0.41, 0.21);
INSERT INTO `饲料描述及常规成分` VALUES ('7', '4-07-0274', '大麦(裸)naked barley grain', '裸大麦,成熟GB/T 11760-2008 2级', 87, 13, 2.1, 2, 67.7, 2.2, 10, 2.2, 50.2, 0.04, 0.39, 0.12);
INSERT INTO `饲料描述及常规成分` VALUES ('8', '4-07-0277', '大麦(皮)barley grain', '皮大麦,成熟GB 10367-89 1级', 87, 11, 1.7, 4.8, 67.1, 2.4, 18.4, 6.8, 52.2, 0.09, 0.33, 0.1);
INSERT INTO `饲料描述及常规成分` VALUES ('9', '4-07-0281', '黑麦rye', '籽粒,进口', 88, 9.5, 1.5, 2.2, 73, 1.8, 12.3, 4.6, 56.5, 0.05, 0.3, 0.14);
INSERT INTO `饲料描述及常规成分` VALUES ('10', '4-07-0273', '稻谷paddy', '成熟,晒干NY/T 2级', 86, 7.8, 1.6, 8.2, 63.8, 4.6, 27.4, 13.7, 63, 0.03, 0.36, 0.15);
INSERT INTO `饲料描述及常规成分` VALUES ('11', '4-07-0276', '糙米rough rice', '除去外壳的大米，GB/T 18810-2002,1级', 87, 8.8, 2, 0.7, 74.2, 1.3, 1.6, 0.8, 47.8, 0.03, 0.35, 0.13);
INSERT INTO `饲料描述及常规成分` VALUES ('12', '4-07-0275', '碎米broken rice', '加工精米后的副产品GB/T 5503-2009 1级', 88, 10.4, 2.2, 1.1, 72.7, 1.6, 0.8, 0.6, 51.6, 0.06, 0.35, 0.12);
INSERT INTO `饲料描述及常规成分` VALUES ('13', '4-07-0479', '粟（谷子）millet grain', '合格,带壳,成熟', 86.5, 9.7, 2.3, 6.8, 65, 2.7, 15.2, 13.3, 63.2, 0.12, 0.3, 0.09);
INSERT INTO `饲料描述及常规成分` VALUES ('14', '4-04-0067', '木薯干cassava tuber flake', '木薯干片,晒干 GB 10369-89合格', 87, 2.5, 0.7, 2.5, 79.4, 1.9, 8.4, 6.4, 71.6, 0.27, 0.09, 0.03);
INSERT INTO `饲料描述及常规成分` VALUES ('15', '4-04-0068', '甘薯干sweet potato tuber flake', '甘薯干片,晒干NY/T 121-1989合格', 87, 4, 0.8, 2.8, 76.4, 3, 8.1, 4.1, 64.5, 0.19, 0.02, NULL);
INSERT INTO `饲料描述及常规成分` VALUES ('16', '4-08-0104', '次粉wheat middling and red dog', '黑面,黄粉,下面NY/T 211-1992 1级', 88, 15.4, 2.2, 1.5, 67.1, 1.5, 18.7, 4.3, 37.8, 0.08, 0.48, 0.17);
INSERT INTO `饲料描述及常规成分` VALUES ('17', '4-08-0105', '次粉wheat middling and red dog', '黑面,黄粉,下面NY/T 211-1992 2级', 87, 13.6, 2.1, 2.8, 66.7, 1.8, 31.9, 10.5, 36.7, 0.08, 0.48, 0.17);
INSERT INTO `饲料描述及常规成分` VALUES ('18', '4-08-0069', '小麦麸wheat bran', '传统制粉工艺GB 10368-1989 1级', 87, 15.7, 3.9, 6.5, 56, 4.9, 37, 13, 22.6, 0.11, 0.92, 0.32);
INSERT INTO `饲料描述及常规成分` VALUES ('19', '4-08-0070', '小麦麸wheat bran', '传统制粉工艺 GB 10368-1989 2级', 87, 14.3, 4, 6.8, 57.1, 4.8, 41.3, 11.9, 19.8, 0.1, 0.93, 0.33);
INSERT INTO `饲料描述及常规成分` VALUES ('20', '4-08-0041', '米糠rice bran', '新鲜,不脱脂NY/T 2级', 90, 14.5, 15.5, 6.8, 45.6, 7.6, 20.3, 11.6, 27.4, 0.05, 2.37, 0.35);
INSERT INTO `饲料描述及常规成分` VALUES ('21', '4-10-0025', '米糠饼rice bran meal(exp.)', '未脱脂,机榨NY/T 1级', 90, 15, 9.2, 7.6, 49.3, 8.9, 28.3, 11.9, 30.9, 0.14, 1.73, 0.25);
INSERT INTO `饲料描述及常规成分` VALUES ('22', '4-10-0018', '米糠粕rice bran meal(sol.)', '浸提或预压浸提,NY/T 1级', 87, 15.1, 2, 7.5, 53.6, 8.8, 23.3, 10.9, 25, 0.15, 1.82, 0.25);
INSERT INTO `饲料描述及常规成分` VALUES ('23', '5-09-0127', '大豆soybean', '黄大豆,成熟GB 1352-86 2级', 87, 35.5, 17.3, 4.3, 25.7, 4.2, 7.9, 7.3, 2.6, 0.27, 0.48, 0.12);
INSERT INTO `饲料描述及常规成分` VALUES ('24', '5-09-0128', '全脂大豆 full-fat soybean', '微粒化 GB/T 20411-2006', 88, 35.5, 18.7, 4.6, 25.2, 4, 11, 6.4, 6.7, 0.32, 0.4, 0.1);
INSERT INTO `饲料描述及常规成分` VALUES ('25', '5-10-0241', '大豆饼soybean meal(exp.)', '机榨 GB 10379-989 2级', 89, 41.8, 5.8, 4.8, 30.7, 5.9, 18.1, 15.5, 3.6, 0.31, 0.5, 0.13);
INSERT INTO `饲料描述及常规成分` VALUES ('26', '5-10-0103', '去皮大豆粕soybean meal(sol.)', '去皮,浸提或预压浸提NY/T 1级', 89, 47.9, 1.5, 3.3, 29.7, 4.9, 8.8, 5.3, 1.8, 0.34, 0.65, 0.24);
INSERT INTO `饲料描述及常规成分` VALUES ('27', '5-10-0102', '大豆粕soybean meal(sol.)', '浸提或预压浸提GB/T 19541-2017', 89, 44.2, 1.9, 5.9, 28.3, 6.1, 13.6, 9.6, 3.5, 0.33, 0.62, 0.16);
INSERT INTO `饲料描述及常规成分` VALUES ('28', '5-10-0118', '棉籽饼cottonseed meal(exp.)', '机榨NY/ T 129-1989 2级', 88, 36.3, 7.4, 12.5, 26.1, 5.7, 32.1, 22.9, 3, 0.21, 0.83, 0.21);
INSERT INTO `饲料描述及常规成分` VALUES ('29', '5-10-0119', '棉籽粕cottonseed meal(sol.)', '浸提GB 21264-2007 1级', 90, 47, 0.5, 10.2, 26.3, 6, 22.5, 15.3, 1.5, 0.25, 1.1, 0.28);
INSERT INTO `饲料描述及常规成分` VALUES ('30', '5-10-0117', '棉籽粕cottonseed meal(sol.)', '浸提GB 21264-2007 2级', 90, 43.5, 0.5, 10.5, 28.9, 6.6, 28.4, 19.4, 1.8, 0.28, 1.04, 0.26);
INSERT INTO `饲料描述及常规成分` VALUES ('31', '5-10-0220', '棉籽蛋白cottonseed protein', '脱酚,低温一次浸出,分步萃取', 92, 51.1, 1, 6.9, 27.3, 5.7, 20, 13.7, 0.9, 0.29, 0.89, 0.22);
INSERT INTO `饲料描述及常规成分` VALUES ('32', '5-10-0183', '菜籽饼rapeseed meal(exp.)', '机榨NY/ T 1799-2009 2级', 88, 35.7, 7.4, 11.4, 26.3, 7.2, 33.3, 26, 3.8, 0.59, 0.96, 0.2);
INSERT INTO `饲料描述及常规成分` VALUES ('33', '5-10-0121', '菜籽粕rapeseed meal(sol.)', '浸提GB/T 23736-2009 2级', 88, 38.6, 1.4, 11.8, 28.9, 7.3, 20.7, 16.8, 6.1, 0.65, 1.02, 0.25);
INSERT INTO `饲料描述及常规成分` VALUES ('34', '5-10-0116', '花生仁饼peanut meal (exp.)', '机榨NY/ T 132-2019 2级', 88, 44.7, 7.2, 5.9, 25.1, 5.1, 14, 8.7, 6.6, 0.25, 0.53, 0.16);
INSERT INTO `饲料描述及常规成分` VALUES ('35', '5-10-0115', '花生仁粕peanut meal(sol.)', '浸提GB 10382-1989 2级', 88, 47.8, 1.4, 6.2, 27.2, 5.4, 15.5, 11.7, 6.7, 0.27, 0.56, 0.17);
INSERT INTO `饲料描述及常规成分` VALUES ('36', '1-10-0031', '向日葵仁饼sunflower meal(exp.)', '壳仁比 35:65 NY/ T 128-1989 3级', 88, 29, 2.9, 20.4, 31, 4.7, 41.4, 29.6, 2, 0.24, 0.87, 0.22);
INSERT INTO `饲料描述及常规成分` VALUES ('37', '5-10-0242', '向日葵仁粕sunflower meal(sol.)', '壳仁比 16:84 GB 10377-89 T 2 级', 88, 36.5, 1, 10.5, 34.4, 5.6, 14.9, 13.6, 6.2, 0.27, 1.13, 0.29);
INSERT INTO `饲料描述及常规成分` VALUES ('38', '5-10-0243', '向日葵仁粕sunflower meal(sol.)', '壳仁比 24:76 GB 10377-89 T 2 级', 88, 33.6, 1, 14.8, 38.8, 5.3, 32.8, 23.5, 4.4, 0.26, 1.03, 0.26);
INSERT INTO `饲料描述及常规成分` VALUES ('39', '5-10-0119', '亚麻仁饼linseed meal(exp.)', '机榨NY/ T 216-1992 2级', 88, 32.2, 7.8, 7.8, 34, 6.2, 29.7, 27.1, 11.4, 0.39, 0.88, 0.22);
INSERT INTO `饲料描述及常规成分` VALUES ('40', '5-10-0120', '亚麻仁粕linseed meal(sol.)', '浸 提 或 预 压 浸 提 NY/T 215-1992 2级', 88, 34.8, 1.8, 8.2, 36.6, 6.6, 21.6, 14.4, 13, 0.42, 0.95, 0.24);
INSERT INTO `饲料描述及常规成分` VALUES ('41', '5-10-0246', '芝麻饼sesame meal(exp.)', '机榨,CP40%', 92, 39.2, 10.3, 7.2, 24.9, 10.4, 18, 13.2, 1.8, 2.24, 1.19, 0.31);
INSERT INTO `饲料描述及常规成分` VALUES ('42', '5-11-0001', '玉米蛋白粉corn gluten meal', '去胚芽、淀粉后的面筋部分 NY 685-2003 1级', 90.1, 63.5, 5.4, 1, 19.2, 1, 8.7, 4.6, 17.2, 0.07, 0.44, 0.16);
INSERT INTO `饲料描述及常规成分` VALUES ('43', '5-11-0002', '玉米蛋白粉corn gluten meal', '同上,中等蛋白质产品,CP50% NY/T 685-2003 2级', 88, 56.3, 4.7, 1.3, 23.4, 2.3, 8.2, 5.1, 16.1, 0.04, 0.44, 0.15);
INSERT INTO `饲料描述及常规成分` VALUES ('44', '5-11-0008', '玉米蛋白粉corn gluten meal', '同上,中等蛋白质产品,CP40% NY/T 685-2003 3级', 89.9, 44.3, 6, 1.6, 37.1, 0.9, 29.1, 8.2, 20.6, 0.12, 0.5, 0.31);
INSERT INTO `饲料描述及常规成分` VALUES ('45', '5-11-0003', '玉米蛋白饲料corn gluten feed', '玉米去胚芽、淀粉后的含皮残渣', 88, 18.3, 7.5, 7.8, 47, 5.4, 33.6, 10.5, 21.5, 0.15, 0.7, 0.17);
INSERT INTO `饲料描述及常规成分` VALUES ('46', '4-10-0026', '玉米胚芽饼corn germ meal(exp.)', '玉米湿磨后的胚芽,机榨', 90, 16.7, 9.6, 6.3, 50.8, 6.6, 28.5, 7.4, 13.5, 0.04, 0.5, 0.15);
INSERT INTO `饲料描述及常规成分` VALUES ('47', '4-10-0244', '玉米胚芽粕corn germ meal(sol.)', '玉米湿磨后的胚芽,浸提', 90, 20.8, 2, 6.5, 54.8, 5.9, 38.2, 10.7, 14.2, 0.06, 0.5, 0.15);
INSERT INTO `饲料描述及常规成分` VALUES ('48', '5-11-0007', 'DDGS(distiller dried grains with solubles)', '玉米酒精糟及可溶物,脱水', 89.2, 27.5, 10.1, 6.6, 39.9, 5.1, 38.3, 12.5, 4.2, 0.06, 0.71, 0.48);
INSERT INTO `饲料描述及常规成分` VALUES ('49', '5-11-0009', '蚕豆粉浆蛋白粉broad bean gluten meal', '蚕豆去皮制粉丝后的浆液,脱水', 88, 66.3, 4.7, 4.1, 10.3, 2.6, 13.7, 9.7, NULL, NULL, 0.59, 0.18);
INSERT INTO `饲料描述及常规成分` VALUES ('50', '5-11-0004', '麦芽根barley malt sprouts', '大麦芽副产品,干燥', 89.7, 28.3, 1.4, NULL, 12.5, 41.4, 6.1, 40, 15.1, 7.2, 0.22, 0.73);
INSERT INTO `饲料描述及常规成分` VALUES ('51', '5-13-0044', '鱼粉(CP67%) fish meal', '进口GB/T 19164-2003,特级', 92.4, 67, 8.4, NULL, 0.2, 0.4, 16.4, NULL, NULL, NULL, 4.56, 2.88);
INSERT INTO `饲料描述及常规成分` VALUES ('52', '5-13-0046', '鱼粉(CP60.2%) fish meal', '沿海产的海鱼粉,脱脂,12样平均值', 90, 60.2, 4.9, NULL, 0.5, 11.6, 12.8, NULL, NULL, NULL, 4.04, 2.9);
INSERT INTO `饲料描述及常规成分` VALUES ('53', '5-13-0077', '鱼粉(CP53.5%) fish meal', '沿海产的海鱼粉,脱脂,11样平均值', 90, 53.5, 10, NULL, 0.8, 4.9, 20.8, NULL, NULL, NULL, 5.88, 3.2);
INSERT INTO `饲料描述及常规成分` VALUES ('54', '5-13-0036', '血粉blood meal', '鲜猪血 喷雾干燥, 国产', 88, 82.8, 0.4, NULL, NULL, 1.6, 3.2, NULL, NULL, NULL, 0.29, 0.31);
INSERT INTO `饲料描述及常规成分` VALUES ('55', '5-13-0037', '羽毛粉feather meal', '纯净羽毛,水解，国产', 88, 77.9, 2.2, NULL, 0.7, 1.4, 5.8, NULL, NULL, NULL, 0.2, 0.68);
INSERT INTO `饲料描述及常规成分` VALUES ('56', '5-13-0038', '皮革粉leather meal', '废牛皮,水解，国产', 88, 74.7, 0.8, NULL, 1.6, NULL, 10.9, NULL, NULL, NULL, 4.4, 0.15);
INSERT INTO `饲料描述及常规成分` VALUES ('57', '5-13-0047', '肉骨粉meat and bone meal', '屠宰下脚,带骨干燥粉碎', 93, 50, 8.5, NULL, 2.8, NULL, 31.7, NULL, NULL, NULL, 9.2, 4.7);
INSERT INTO `饲料描述及常规成分` VALUES ('58', '5-13-0048', '肉粉meat meal', '脱脂，国产', 94, 54, 12, NULL, 1.4, 4.3, 22.3, NULL, NULL, NULL, 7.69, 3.88);
INSERT INTO `饲料描述及常规成分` VALUES ('59', '1-05-0074', '苜蓿草粉(CP19%)alfalfa meal', '一茬盛花期烘干NY/T 140-2002 1级', 87, 19.1, 2.3, NULL, 22.7, 35.3, 7.6, 36.7, 25, 6.1, 1.4, 0.51);
INSERT INTO `饲料描述及常规成分` VALUES ('60', '1-05-0075', '苜蓿草粉(CP17%)alfalfa meal', '一茬盛花期烘干NY/T 140-2002 2级', 87, 17.2, 2.6, NULL, 25.6, 33.3, 8.3, 39, 28.6, 3.4, 1.52, 0.22);
INSERT INTO `饲料描述及常规成分` VALUES ('61', '1-05-0076', '苜蓿草粉(CP14%-15%)alfalfa meal', 'NY/T 140-2002 3级', 87, 14.3, 2.1, NULL, 29.8, 33.8, 10.1, 36.8, 29, 3.5, 1.34, 0.19);
INSERT INTO `饲料描述及常规成分` VALUES ('62', '5-11-0005', '啤酒糟brewers dried grain', '大麦酿造副产品', 88, 24.3, 5.3, NULL, 13.4, 40.8, 4.2, 39.4, 24.6, 11.5, 0.32, 0.42);
INSERT INTO `饲料描述及常规成分` VALUES ('63', '7-15-0001', '啤酒酵母brewers dried yeast', '啤酒酵母菌粉,QB/T1940-94', 91.7, 52.4, 0.4, NULL, 0.6, 33.6, 4.7, 6.1, 1.8, 1, 0.16, 1.02);
INSERT INTO `饲料描述及常规成分` VALUES ('64', '4-13-0075', '乳清粉whey, dehydrated', '乳清,脱水,乳糖含量73%', 97.2, 11.5, 0.8, NULL, 0.1, 76.8, 8, NULL, NULL, NULL, 0.62, 0.69);
INSERT INTO `饲料描述及常规成分` VALUES ('65', '5-01-0162', '酪蛋白casein', '脱水, 来源于牛奶', 91.7, 89, 0.2, NULL, NULL, 0.4, 2.1, NULL, NULL, NULL, 0.2, 0.68);
INSERT INTO `饲料描述及常规成分` VALUES ('66', '5-14-0503', '明胶gelatin', '食用', 90, 88.6, 0.5, NULL, NULL, 0.59, 0.31, NULL, NULL, NULL, 0.49, NULL);
INSERT INTO `饲料描述及常规成分` VALUES ('67', '4-06-0076', '牛奶乳糖milk lactose', '进口,含乳糖80%以上', 96, 3.5, 0.5, NULL, NULL, 82, 10, NULL, NULL, NULL, 0.52, 0.62);
INSERT INTO `饲料描述及常规成分` VALUES ('68', '4-06-0077', '乳糖lactose', '食用', 96, 0.3, NULL, NULL, NULL, 95.7, NULL, NULL, NULL, NULL, NULL, NULL);
INSERT INTO `饲料描述及常规成分` VALUES ('69', '4-06-0078', '葡萄糖glucose', '食用', 90, 0.3, NULL, NULL, NULL, 89.7, NULL, NULL, NULL, NULL, NULL, NULL);
INSERT INTO `饲料描述及常规成分` VALUES ('70', '4-06-0079', '蔗糖sucrose', '食用', 99, NULL, NULL, NULL, NULL, 98.5, 0.5, NULL, NULL, NULL, 0.04, NULL);
INSERT INTO `饲料描述及常规成分` VALUES ('71', '4-02-0889', '玉米淀粉corn starch', '食用', 99, 0.3, 0.2, NULL, 98.5, NULL, NULL, NULL, 98, NULL, 0.03, 0.01);
INSERT INTO `饲料描述及常规成分` VALUES ('72', '4-17-0001', '牛脂 beef tallow', NULL, 99, NULL, 0, NULL, 0.5, 0.5, NULL, NULL, NULL, NULL, NULL, NULL);
INSERT INTO `饲料描述及常规成分` VALUES ('73', '4-17-0002', '猪油lard', NULL, 99, NULL, 0, NULL, 0.5, 0.5, NULL, NULL, NULL, NULL, NULL, NULL);
INSERT INTO `饲料描述及常规成分` VALUES ('74', '4-17-0003', '家禽脂肪poultry fat', NULL, 99, NULL, 0, NULL, 0.5, 0.5, NULL, NULL, NULL, NULL, NULL, NULL);
INSERT INTO `饲料描述及常规成分` VALUES ('75', '4-17-0004', '鱼油fish oil', NULL, 99, NULL, 0, NULL, 0.5, 0.5, NULL, NULL, NULL, NULL, NULL, 0);
INSERT INTO `饲料描述及常规成分` VALUES ('76', '4-17-0005', '菜籽油rapeseed oil', NULL, 99, NULL, 0, NULL, 0.5, 0.5, NULL, NULL, NULL, NULL, NULL, 0);
INSERT INTO `饲料描述及常规成分` VALUES ('77', '4-17-0006', '椰子油coconut oil', NULL, 99, NULL, 0, NULL, 0.5, 0.5, NULL, NULL, NULL, NULL, NULL, 0);
INSERT INTO `饲料描述及常规成分` VALUES ('78', '4-07-0007', '玉米油corn oil', NULL, 99, NULL, 0, NULL, 0.5, 0.5, NULL, NULL, NULL, NULL, NULL, 0);
INSERT INTO `饲料描述及常规成分` VALUES ('79', '4-17-0008', '棉籽油cottonseed oil', NULL, 99, NULL, 0, NULL, 0.5, 0.5, NULL, NULL, NULL, NULL, NULL, 0);
INSERT INTO `饲料描述及常规成分` VALUES ('80', '4-17-0009', '棕榈油palm oil', NULL, 99, NULL, 0, NULL, 0.5, 0.5, NULL, NULL, NULL, NULL, NULL, 0);
INSERT INTO `饲料描述及常规成分` VALUES ('81', '4-17-0010', '花生油peanuts oil', NULL, 99, NULL, 0, NULL, 0.5, 0.5, NULL, NULL, NULL, NULL, NULL, 0);
INSERT INTO `饲料描述及常规成分` VALUES ('82', '4-17-0011', '芝麻油sesame oil', NULL, 99, NULL, 0, NULL, 0.5, 0.5, NULL, NULL, NULL, NULL, NULL, 0);
INSERT INTO `饲料描述及常规成分` VALUES ('83', '4-17-0012', '大豆油soybean oil', '粗制', 99, NULL, 0, NULL, 0.5, 0.5, NULL, NULL, NULL, NULL, NULL, 0);
INSERT INTO `饲料描述及常规成分` VALUES ('84', '4-17-0013', '葵花油sunflower oil', NULL, 99, NULL, 0, NULL, 0.5, 0.5, NULL, NULL, NULL, NULL, NULL, 0);

SET FOREIGN_KEY_CHECKS = 1;
